GopalSaraf/Practicals/PSDL/include/proc/pic18f67k22.inc
// Register: PMD0
#define PMD0 PMD0
PMD0                                     equ 0F19h
// bitfield definitions
PMD0_ADCMD_POSN                          equ 0000h
PMD0_ADCMD_POSITION                      equ 0000h
PMD0_ADCMD_SIZE                          equ 0001h
PMD0_ADCMD_LENGTH                        equ 0001h
PMD0_ADCMD_MASK                          equ 0001h
PMD0_SSP1MD_POSN                         equ 0001h
PMD0_SSP1MD_POSITION                     equ 0001h
PMD0_SSP1MD_SIZE                         equ 0001h
PMD0_SSP1MD_LENGTH                       equ 0001h
PMD0_SSP1MD_MASK                         equ 0002h
PMD0_SSP2MD_POSN                         equ 0002h
PMD0_SSP2MD_POSITION                     equ 0002h
PMD0_SSP2MD_SIZE                         equ 0001h
PMD0_SSP2MD_LENGTH                       equ 0001h
PMD0_SSP2MD_MASK                         equ 0004h
PMD0_UART1MD_POSN                        equ 0003h
PMD0_UART1MD_POSITION                    equ 0003h
PMD0_UART1MD_SIZE                        equ 0001h
PMD0_UART1MD_LENGTH                      equ 0001h
PMD0_UART1MD_MASK                        equ 0008h
PMD0_UART2MD_POSN                        equ 0004h
PMD0_UART2MD_POSITION                    equ 0004h
PMD0_UART2MD_SIZE                        equ 0001h
PMD0_UART2MD_LENGTH                      equ 0001h
PMD0_UART2MD_MASK                        equ 0010h
PMD0_CCP1MD_POSN                         equ 0005h
PMD0_CCP1MD_POSITION                     equ 0005h
PMD0_CCP1MD_SIZE                         equ 0001h
PMD0_CCP1MD_LENGTH                       equ 0001h
PMD0_CCP1MD_MASK                         equ 0020h
PMD0_CCP2MD_POSN                         equ 0006h
PMD0_CCP2MD_POSITION                     equ 0006h
PMD0_CCP2MD_SIZE                         equ 0001h
PMD0_CCP2MD_LENGTH                       equ 0001h
PMD0_CCP2MD_MASK                         equ 0040h
PMD0_CCP3MD_POSN                         equ 0007h
PMD0_CCP3MD_POSITION                     equ 0007h
PMD0_CCP3MD_SIZE                         equ 0001h
PMD0_CCP3MD_LENGTH                       equ 0001h
PMD0_CCP3MD_MASK                         equ 0080h
PMD0_SPI1MD_POSN                         equ 0001h
PMD0_SPI1MD_POSITION                     equ 0001h
PMD0_SPI1MD_SIZE                         equ 0001h
PMD0_SPI1MD_LENGTH                       equ 0001h
PMD0_SPI1MD_MASK                         equ 0002h
PMD0_SPI2MD_POSN                         equ 0002h
PMD0_SPI2MD_POSITION                     equ 0002h
PMD0_SPI2MD_SIZE                         equ 0001h
PMD0_SPI2MD_LENGTH                       equ 0001h
PMD0_SPI2MD_MASK                         equ 0004h

// Register: PSTR3CON
#define PSTR3CON PSTR3CON
PSTR3CON                                 equ 0F1Ah
// bitfield definitions
PSTR3CON_STRA_POSN                       equ 0000h
PSTR3CON_STRA_POSITION                   equ 0000h
PSTR3CON_STRA_SIZE                       equ 0001h
PSTR3CON_STRA_LENGTH                     equ 0001h
PSTR3CON_STRA_MASK                       equ 0001h
PSTR3CON_STRB_POSN                       equ 0001h
PSTR3CON_STRB_POSITION                   equ 0001h
PSTR3CON_STRB_SIZE                       equ 0001h
PSTR3CON_STRB_LENGTH                     equ 0001h
PSTR3CON_STRB_MASK                       equ 0002h
PSTR3CON_STRC_POSN                       equ 0002h
PSTR3CON_STRC_POSITION                   equ 0002h
PSTR3CON_STRC_SIZE                       equ 0001h
PSTR3CON_STRC_LENGTH                     equ 0001h
PSTR3CON_STRC_MASK                       equ 0004h
PSTR3CON_STRD_POSN                       equ 0003h
PSTR3CON_STRD_POSITION                   equ 0003h
PSTR3CON_STRD_SIZE                       equ 0001h
PSTR3CON_STRD_LENGTH                     equ 0001h
PSTR3CON_STRD_MASK                       equ 0008h
PSTR3CON_STRSYNC_POSN                    equ 0004h
PSTR3CON_STRSYNC_POSITION                equ 0004h
PSTR3CON_STRSYNC_SIZE                    equ 0001h
PSTR3CON_STRSYNC_LENGTH                  equ 0001h
PSTR3CON_STRSYNC_MASK                    equ 0010h
PSTR3CON_CMPL_POSN                       equ 0006h
PSTR3CON_CMPL_POSITION                   equ 0006h
PSTR3CON_CMPL_SIZE                       equ 0002h
PSTR3CON_CMPL_LENGTH                     equ 0002h
PSTR3CON_CMPL_MASK                       equ 00C0h
PSTR3CON_CMPL0_POSN                      equ 0006h
PSTR3CON_CMPL0_POSITION                  equ 0006h
PSTR3CON_CMPL0_SIZE                      equ 0001h
PSTR3CON_CMPL0_LENGTH                    equ 0001h
PSTR3CON_CMPL0_MASK                      equ 0040h
PSTR3CON_CMPL1_POSN                      equ 0007h
PSTR3CON_CMPL1_POSITION                  equ 0007h
PSTR3CON_CMPL1_SIZE                      equ 0001h
PSTR3CON_CMPL1_LENGTH                    equ 0001h
PSTR3CON_CMPL1_MASK                      equ 0080h
PSTR3CON_STRA3_POSN                      equ 0000h
PSTR3CON_STRA3_POSITION                  equ 0000h
PSTR3CON_STRA3_SIZE                      equ 0001h
PSTR3CON_STRA3_LENGTH                    equ 0001h
PSTR3CON_STRA3_MASK                      equ 0001h
PSTR3CON_STRB3_POSN                      equ 0001h
PSTR3CON_STRB3_POSITION                  equ 0001h
PSTR3CON_STRB3_SIZE                      equ 0001h
PSTR3CON_STRB3_LENGTH                    equ 0001h
PSTR3CON_STRB3_MASK                      equ 0002h
PSTR3CON_STRC3_POSN                      equ 0002h
PSTR3CON_STRC3_POSITION                  equ 0002h
PSTR3CON_STRC3_SIZE                      equ 0001h
PSTR3CON_STRC3_LENGTH                    equ 0001h
PSTR3CON_STRC3_MASK                      equ 0004h
PSTR3CON_STRD3_POSN                      equ 0003h
PSTR3CON_STRD3_POSITION                  equ 0003h
PSTR3CON_STRD3_SIZE                      equ 0001h
PSTR3CON_STRD3_LENGTH                    equ 0001h
PSTR3CON_STRD3_MASK                      equ 0008h
PSTR3CON_STRSYNC3_POSN                   equ 0004h
PSTR3CON_STRSYNC3_POSITION               equ 0004h
PSTR3CON_STRSYNC3_SIZE                   equ 0001h
PSTR3CON_STRSYNC3_LENGTH                 equ 0001h
PSTR3CON_STRSYNC3_MASK                   equ 0010h
PSTR3CON_CMPL03_POSN                     equ 0006h
PSTR3CON_CMPL03_POSITION                 equ 0006h
PSTR3CON_CMPL03_SIZE                     equ 0001h
PSTR3CON_CMPL03_LENGTH                   equ 0001h
PSTR3CON_CMPL03_MASK                     equ 0040h
PSTR3CON_CMPL13_POSN                     equ 0007h
PSTR3CON_CMPL13_POSITION                 equ 0007h
PSTR3CON_CMPL13_SIZE                     equ 0001h
PSTR3CON_CMPL13_LENGTH                   equ 0001h
PSTR3CON_CMPL13_MASK                     equ 0080h

